docs/thesis/outline.tex

\section{Introduction}
\label{sec-1}

\subsection{Why erasibility?}
\label{sec-1.1}

\subsection{Why homotopy type theory?}
\label{sec-1.2}

\subsection{Contributions}
\label{sec-1.3}

\subsubsection{Introduction to homotopy type theory}
\label{sec-1.3.1}

An introduction to the basics of homotopy type theory geared towards
computer scientists, since all current introductions are written in
mind with the mathematician without any knowledge of type
theory. Instead, we want to introduce the subject to the computer
scientist who has some experience programming in dependently typed
languages such as Agda or Coq. 

\subsubsection{Identify how HoTT can be interesting for programming}
\label{sec-1.3.2}


\subsubsection{Comparison of collapsibility and hProp}
\label{sec-1.3.3}

A comparison of Brady's concept of collapsible type families and the
definition of hProp from homotopy type theory. We will see which of
the optimisation techniques can be applied if we replace collapsible
with hProp.

\subsubsection{Comparison of hProp and Coq's Prop universe}
\label{sec-1.3.4}

In Coq, Prop serves several purposes. One of these is erasibility with
respect to extraction: all the terms that live in Prop are erased
during extraction.


\section{Introduction to homotopy type theory}
\label{sec-2}

\subsection{Explain some basic stuff about homotopy?}
\label{sec-2.1}


\subsection{Intensional versus extensional}
\label{sec-2.2}

Explain the difference and how HoTT fits in this picture. Also note
that function extensionality is somewhat orthogonal to this
discussion.

\subsection{h-levels}
\label{sec-2.3}

\subsubsection{Motivate why we want to look at h-levels.}
\label{sec-2.3.1}


\subsubsection{Definition of |Contractible : A -> Set|}
\label{sec-2.3.2}


Explain how the unit type is contractible, but the empty type is
not. Also explain the homotopic intuition and explain that this is
definition, according to that interpretation, is really different from
saying that a type has exactly one inhabitant. For example: the disc
is homotopically equivalent to a one-point space, yet the disc clearly
has more inhabitants.

\begin{itemize}

\item \textbf{TODO} Prove that unit type is contractible\\
\label{sec-2.3.2.1}


\item \textbf{TODO} Prove that empty type is not contractible\\
\label{sec-2.3.2.2}


\item \textbf{TODO} Prove that the interval is contractible\\
\label{sec-2.3.2.3}


\item \textbf{TODO} Note that one has to be careful with "geometric" intuition\\
\label{sec-2.3.2.4}

Having a center for which there is a path from every other point in
the space is not entirely correct: S1 satisfies that property, but is
not contractible. The key here is having to satisfy that property in
some continuous way. It may also be nice to show other equivalent
notions of contractibility to make this clearer.

\end{itemize} % ends low level
\subsubsection{Inductive definition of h-levels}
\label{sec-2.3.3}


\begin{code}
  h-level A 0 = Contractible A
  h-level A (n + 1) = forall x, y : A, h-level (Id A x y) n
\end{code}

\begin{itemize}

\item \textbf{TODO} Explain filtration property\\
\label{sec-2.3.3.1}


\item \textbf{TODO} Note that the h-level needn't be finite.\\
\label{sec-2.3.3.2}


\end{itemize} % ends low level
\subsubsection{h-propositions}
\label{sec-2.3.4}


Types of h-level 1 are also called hProp, short for
h-proposition. Types in hProp are either empty or contractible, so
they are homotopically equivalent to either the bottom or unit
type. (Note that one has to be careful with this sentence when one
tries to formally prove this.) This is also where the name
``proposition'' comes from: bottom and unit are the homotopy type
theoretic counterparts of the truth values false and true in classical
logic, i.e. it can be seen as the intuistionistic brother of the boolean
algebra $\{0,1\}$. 

\begin{itemize}

\item \textbf{TODO} Show how unit is an hProp and empty as well.\\
\label{sec-2.3.4.1}

As corollary of filtration and contractibility.

\end{itemize} % ends low level
\subsubsection{h-sets}
\label{sec-2.3.5}


Another important class of types, are the hSets: the types of
h-level 2. These correspond to discrete groupoids: the only arrows are
the identity arrows. This means that the only equalities there are,
are the reflexivity proofs. In other words, hSets satisfy the
uniqueness of identity proofs property and therefore also axiom K,
which means we can properly pattern match on them. Indeed, if we work
in Agda (without the --without-k flag), these are the only types we
can construct.

\begin{itemize}

\item \textbf{TODO} Show how booleans are in hSet.\\
\label{sec-2.3.5.1}


\end{itemize} % ends low level
\subsubsection{Higher inductive types}
\label{sec-2.3.6}


\begin{itemize}

\item \textbf{TODO} Explain that these are really new.\\
\label{sec-2.3.6.1}



\item \textbf{TODO} Example: universe of types with isomorphism as equality\\
\label{sec-2.3.6.2}

booleans are isomorphic to itself in several ways.


\item \textbf{TODO} Prove that interval implies function extensionality.\\
\label{sec-2.3.6.3}


\end{itemize} % ends low level
\section{hProp and proof irrelevance}
\label{sec-3}


Show that things in hProp can be relevant in a more subtle sense. We
can write two ``different'' isomorphisms |T -> I| that are equivalent
propositionally, but definitionally not the same. This can influence
computations. Of course, the results will always be propositionally
equal.

\section{Collapsibility}
\label{sec-4}


We call a type family |D : (A : Set) -> Set| collapsible if it
satisfies the following property:

if we have two inhabitants |x, y : D ss| for some index |ss : A|,
then |x| and |y| are convertible.

\subsection{Collapsibility versus hProp}
\label{sec-4.1}


At first glance, we notice that the definition looks a lot like the
definition of hProp, where the internal equality (the identity types)
is replaced by convertibility, which is a relation external to the
system: we cannot prove anything about the convertibility relation
inside the system.

Another important, but more subtle, difference is that we have an
additional condition under which the equality (convertibility in this
case) must hold, namely it must hold in the empty context. 

\subsubsection{\textbf{TODO} Explain where this condition comes from}
\label{sec-4.1.1}

Something to do with it being a run-time optimisation and evaluation
being done in the empty context in that case.

\section{Coq's Prop universe}
\label{sec-5}


This is somewhat interesting, because the extraction mechanism is
concerned with erasing parts of the program. However, one part of the
extraction mechanism that is less interesting to us, are the typing
problems one has in the target languages (e.g. Haskell). Since we take
Brady's approach, we are not interested in that kind of extraction.
